---
kind: property
id: P:Autodesk.Revit.DB.Blend.BottomProfile
source: html/c7ca083a-6376-7fa1-8aa8-9ef1575d0e4d.htm
---
# Autodesk.Revit.DB.Blend.BottomProfile Property

The curves which make up the bottom profile of the sketch.

## Syntax (C#)
```csharp
public CurveArrArray BottomProfile { get; }
```

## Remarks
The indices of the curves in this array match the indices used in the vertex connection map.